Запросить стоимость товара и вывести ее:


со скидкой 10%

let product_ware = 1350;
let finish_ware = product_ware * 0.9;
alert(finish_ware)

с наценкой 10%

let product_ware = 1350;
let finish_ware = product_ware * 1.1;
alert(finish_ware)

со скидкой 25%

let product_ware = 1350;
let finish_ware = product_ware * 0.75;
alert(finish_ware)

со наценкой 25%

let product_ware = 1350;
let finish_ware = product_ware * 1.25;
alert(finish_ware)

со скидкой 1%

let product_ware = 1350;
let finish_ware = product_ware * 0.99;
alert(finish_ware)

с наценкой 1.5%

let product_ware = 1350;
let finish_ware = product_ware * 1.015;
alert(finish_ware)




Запросить у юзера стоимость товара и, если она равна 100 и более, то вывести ее со скидкой в 5%, если менее - без скидки.

let product_price = +prompt("Введите стоимость товара ");
if
(product_price>=100){
alert(product_price*0.95)}
else (product_price<100) 
{ alert (product_price)}

Запросить у юзера число и сравнить его с нулем

let number = +prompt("Введите число ");
if (number >0){
alert("Число больше нуля")};
else(number<0){
alert ("Число меньше нуля")};

Запросить у юзера число и вывести одну цифру, на которое оно заканчивается (мат.решение)

let meaning = +prompt("Введите число ");
let last_meaning = number * 10;
alert(last_meaning);

(опционально) Придумайте названия для следующих функций:


Функция, которая принимает два числа и возвращает их сумму.
Summa

Функция, которая вычисляет среднее значение массива чисел.
Mean

Функция, которая проверяет, является ли число четным.

Even
Функция, которая определяет, является ли число простым.
Prime

Функция для форматирования даты в удобочитаемый вид.
Standart-date


Функция, которая принимает строку и возвращает её с заглавной первой буквой.
Upper_first_letter

Функция, которая обращает порядок элементов в массиве.


Функция, которая генерирует случайное число в заданном диапазоне.
Random_numer


Функция, которая преобразует строку в верхний регистр.
Upper_string

Функция, которая преобразует строку в нижний регистр.
Lower_string

Функция, которая проверяет, является ли строка допустимым адресом электронной почты.
Honest_post

Функция, которая находит наибольшее значение из массива чисел.
Highest_value

Функция, которая находит наименьшее значение из массива чисел.
Smallest_value


Функция, которая вычисляет площадь геометрической фигуры
Square_figure

Функция для перевода температуры из Цельсия в Фаренгейт.
Fahrenheit_change

Функция для перевода температуры из Фаренгейта в Цельсий

Celsius_change

Функция, которая вычисляет факториал числа.
Factorial_value

Функция, которая вычисляет расстояние между двумя точками в пространстве.
Distance

Функция, которая форматирует число как денежную сумму в нужной валюте.
Conversion

Функция, которая возвращает длину строки.
Length
